//
//  main.swift
//  CourseOne
//
//  Created by Денис Курлыков on 19.09.2022.
//

import Foundation


// 1) Повторите что было в уроке.


// 2) Зайти в документацию и Выпишите окло 5 примеров.


// 3) Создать класс в котором будет массив в котором – «мама» «папа» и «дети». Создать sabscript для этого класса что б у класса был доступ как у массива по индексу.


// 4) Создать сабскрипт который будет принимать число умножать его на 100 и делить на 2.


// 5) Создать свой subscript у которого внутри есть оператор if else.


// 6) Создать класс Human и в нем 3 проперти имя , возраст пол. 7) Создать ещё 2 класса которые наследуются от класса Human и переопределить методы и свойства .


// 8) Создать дикшинари который хранит все типы данных которые вы знаете, а ключ должен быть только строка.
